---
kind: method
id: M:Autodesk.Revit.DB.FilledRegionType.IsValidMasking(System.Boolean)
source: html/b0c57e6c-8ca1-1ae4-fba3-4cd7528c40d8.htm
---
# Autodesk.Revit.DB.FilledRegionType.IsValidMasking Method

Check that in a family the FillRegionType is always masking.

## Syntax (C#)
```csharp
public bool IsValidMasking(
	bool isMasking
)
```

## Parameters
- **isMasking** (`System.Boolean`) - The isMasking value to check.

## Returns
True if the IsMasking property can be set to the new value.